app/controllers/ingredients_controller.rb

SELECT "ingredients".* FROM "ingredients"
---
    def index
        ingredients = Ingredient.all

INSERT INTO "ingredients" ("name", "image", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
    def create
        ingredient = Ingredient.create(ingredient_params)