app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
---
    def index
        recipes = Recipe.all

INSERT INTO "recipes" ("user_id", "name", "image", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT "ingredients".* FROM "ingredients"
SELECT "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = $1  [["recipe_id", 1]]
INSERT INTO "recipe_ingredients" ("recipe_id", "ingredient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["recipe_id", 5], ["ingredient_id", 31], ["created_at", "2021-10-07 21:59:34.691646"], ["updated_at", "2021-10-07 21:59:34.691646"]]
INSERT INTO "recipes" ("user_id", "name", "image", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 1], ["name", "t"], ["image", "t"], ["description", "t"], ["created_at", "2021-10-07 21:59:34.657348"], ["updated_at", "2021-10-07 21:59:34.657348"]]
---
    def create
        recipe_attributes = recipe_params.slice("user_id", "name", "image", "description", "instructions")
        recipe = Recipe.create(recipe_attributes)
        recipe_params["recipe_ingredients"].each do |recipe_ingredient|
            rpi = RecipeIngredient.create(ingredient_id: recipe_ingredient["ingredient_id"], recipe: recipe, amount: recipe_ingredient["amount"], unit: recipe_ingredient["unit"])

SELECT "recipe_ingredients".* FROM "recipe_ingredients" WHERE "recipe_ingredients"."recipe_id" = $1  [["recipe_id", 3]]
---
    def update
        # byebug
        recipe = find_recipe
        recipe_attributes = recipe_params.slice("user_id", "name", "image", "description", "instructions")
        recipe.update(recipe_attributes)
        recipe_params["recipe_ingredients"].each do |recipe_ingredient|

DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 5]]
---
    def destroy
        recipe = find_recipe
        recipe.destroy

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def find_recipe
        Recipe.find(params[:id])